#### Installing SQL

In [1]:
pip install -U pandasql

Requirement already satisfied: pandasql in c:\users\mac\anaconda3\lib\site-packages (0.7.3)Note: you may need to restart the kernel to use updated packages.

Requirement already satisfied: numpy in c:\users\mac\anaconda3\lib\site-packages (from pandasql) (1.21.5)
Requirement already satisfied: sqlalchemy in c:\users\mac\anaconda3\lib\site-packages (from pandasql) (1.4.39)
Requirement already satisfied: pandas in c:\users\mac\anaconda3\lib\site-packages (from pandasql) (1.4.4)
Requirement already satisfied: pytz>=2020.1 in c:\users\mac\anaconda3\lib\site-packages (from pandas->pandasql) (2022.1)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\users\mac\anaconda3\lib\site-packages (from pandas->pandasql) (2.8.2)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\mac\anaconda3\lib\site-packages (from sqlalchemy->pandasql) (1.1.1)
Requirement already satisfied: six>=1.5 in c:\users\mac\anaconda3\lib\site-packages (from python-dateutil>=2.8.1->pandas->pandasql) (1.16.0)

In [6]:
# Loading external sql
# This will load the SQL module in the notebook. Now, with the use of %sql magic, you can use SQL queries directly
# in Jupyter Notebook.
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

#### Create a SQLite Database

In [7]:
%sql sqlite://contactInfo.db3

Connection info needed in SQLAlchemy format, example:
               postgresql://username:password@hostname/dbname
               or an existing connection: dict_keys([])
Invalid SQLite URL: sqlite://contactInfo.db3
Valid SQLite URL forms are:
 sqlite:///:memory: (or, sqlite://)
 sqlite:///relative/path/to/file.db
 sqlite:////absolute/path/to/file.db
Connection info needed in SQLAlchemy format, example:
               postgresql://username:password@hostname/dbname
               or an existing connection: dict_keys([])

#### Create a table

In [8]:
%%sql sqlite://
CREATE TABLE contactInfo(
    FirstName VARCHAR(50) NOT NULL,
    LastName VARCHAR(50) NOT NULL,  
    USERID int  NOT NULL UNIQUE, 
    PRIMARY KEY (USERID)
);

Done.

[]

#### Add data to the table

In [9]:
%%sql sqlite://
INSERT INTO contactInfo VALUES ('Akinroye', 'Muideen', 8134324983);
INSERT INTO contactInfo VALUES ('Akinroye', 'Azeez', 7063684912);
INSERT INTO contactInfo VALUES ('Olanipekun', 'Abigeal', 8063362208);
INSERT INTO contactInfo VALUES ('Abiola', 'Olayanju', 7056434242);
INSERT INTO contactInfo VALUES ('Emannuel', 'Clement', 9078474743);

1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

#### Write the First Query

In [10]:
sql_query = %sql SELECT * from contactInfo

 * sqlite://
Done.

In [8]:
sql_query

[('Akinroye', 'Muideen', 8134324983),
 ('Akinroye', 'Azeez', 7063684912),
 ('Olanipekun', 'Abigeal', 8063362208),
 ('Abiola', 'Olayanju', 7056434242),
 ('Emannuel', 'Clement', 9078474743)]

In [9]:
sql_query = %sql SELECT FirstName, LastName from contactInfo

 * sqlite://
Done.

In [10]:
sql_query

[('Akinroye', 'Muideen'),
 ('Akinroye', 'Azeez'),
 ('Olanipekun', 'Abigeal'),
 ('Abiola', 'Olayanju'),
 ('Emannuel', 'Clement')]

In [11]:
%%sql sqlite://
CREATE TABLE employee(
    Name VARCHAR(50) NOT NULL,
    City VARCHAR(50) NOT NULL,  
    Age int(2) NOT NULL, 
    Salary int(5) NOT NULL,  
    EmpID int  NOT NULL UNIQUE, 
    PRIMARY KEY (EmpID)
);

Done.

[]

In [22]:
%%sql sqlite://
INSERT INTO employee VALUES ('Akinroye', 'Lagos', 23, 30000, 1);
INSERT INTO employee VALUES ('Muideen', 'Osun', 53, 30000, 2);
INSERT INTO employee VALUES ('Olawale', 'Oyo', 33, 30000, 3);
INSERT INTO employee VALUES ('Adeleke', 'Abia', 83, 30000, 4);
INSERT INTO employee VALUES ('Martins', 'Kano', 13, 30000, 5);
INSERT INTO employee VALUES ('Dele', 'Kaduna', 29, 30000, 6);
INSERT INTO employee VALUES ('Afeez', 'Enugu', 43, 30000, 7);
INSERT INTO employee VALUES ('Aisha', 'Yobe', 26, 30000, 8);

1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [41]:
sql_query = %sql SELECT * from employee

 * sqlite://
Done.

In [42]:
sql_query

[('Akinroye', 'Lagos', 23, 30000, 1),
 ('Muideen', 'Osun', 53, 30000, 2),
 ('Olawale', 'Oyo', 33, 30000, 3),
 ('Adeleke', 'Abia', 83, 30000, 4),
 ('Martins', 'Kano', 13, 30000, 5),
 ('Dele', 'Kaduna', 29, 30000, 6),
 ('Afeez', 'Enugu', 43, 30000, 7),
 ('Aisha', 'Yobe', 26, 30000, 8)]

In [48]:
    %%sql sqlite://
CREATE TABLE contact(
    Phone_Number int(50) NOT NULL,
    Address VARCHAR(50) NOT NULL, 
    Gender VARCHAR(50) NOT NULL,
    EMPLID int  NOT NULL UNIQUE, 
    PRIMARY KEY (EmpID)
);

(sqlite3.OperationalError) table contact already exists
[SQL: CREATE TABLE contact(
Phone_Number int(50) NOT NULL,
Address VARCHAR(50) NOT NULL,
Gender VARCHAR(50) NOT NULL,
EMPLID int  NOT NULL UNIQUE,
PRIMARY KEY (EmpID)
);]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

In [51]:
drop = "%sql DROP TABLE contact";

In [55]:
%%sql sqlite://
INSERT INTO contact VALUES ('8054098000', 'Brooklyn New York USA', 'F', 2);
INSERT INTO contact VALUES ('1479961014', 'Grenelle Paris France', 'M', 3);
INSERT INTO contact VALUES ('2011503193', 'Geuzenveld Amsterdam Netherlands', 'F', 4);
INSERT INTO contact VALUES ('6723482456', 'Yishun Singapore', 'M', 7);
INSERT INTO contact VALUES ('3577990724', 'Koto City, Tokyo, Japan', 'M', 8)

(sqlite3.IntegrityError) UNIQUE constraint failed: contact.EMPLID
[SQL: INSERT INTO contact VALUES ('8054098000', 'Brooklyn New York USA', 'F', 2);]
(Background on this error at: https://sqlalche.me/e/14/gkpj)

In [58]:
sql_query = "%sql DROP TABLE contact"

In [59]:
sql_query

'%sql DROP TABLE contact'

In [60]:
sql_query

'%sql DROP TABLE contact'

In [63]:
  %%sql sqlite://
CREATE TABLE contactus(
    Phone_Number int(50) NOT NULL,
    Address VARCHAR(50) NOT NULL, 
    Gender VARCHAR(50) NOT NULL,
    EmpID int  NOT NULL UNIQUE, 
    PRIMARY KEY (EmpID)
);

Done.

[]

In [65]:
%%sql sqlite://
INSERT INTO contactus VALUES ('8054098000', 'Brooklyn New York USA', 'F', 2);
INSERT INTO contactus VALUES ('1479961014', 'Grenelle Paris France', 'M', 3);
INSERT INTO contactus VALUES ('2011503193', 'Geuzenveld Amsterdam Netherlands', 'F', 4);
INSERT INTO contactus VALUES ('6723482456', 'Yishun Singapore', 'M', 7);
INSERT INTO contactus VALUES ('3577990724', 'Koto City, Tokyo, Japan', 'M', 8)

1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [66]:
sql_query = %sql SELECT * from contactus

 * sqlite://
Done.

In [67]:
sql_query

[(8054098000, 'Brooklyn New York USA', 'F', 2),
 (1479961014, 'Grenelle Paris France', 'M', 3),
 (2011503193, 'Geuzenveld Amsterdam Netherlands', 'F', 4),
 (6723482456, 'Yishun Singapore', 'M', 7),
 (3577990724, 'Koto City, Tokyo, Japan', 'M', 8)]